app/Controllers/Auth/Login.php

SELECT *
FROM `tb_users`
WHERE `user_username` = 'admin'
 LIMIT 1
---
    public function login_post()
    {
        $identitas = $this->request->getPost('usernameOrEmail');
        $password = $this->request->getPost('password');

        $usersModel = new UsersModel();
        if (filter_var($identitas, FILTER_VALIDATE_EMAIL)) {
            $pengguna = $usersModel->where('email', $identitas)->first();
        } else {
            $pengguna = $usersModel->where('user_username', $identitas)->first();