app/Controllers/Rifkkimaulana/Admin/Artikel/Artikel.php

    public function index()
    {
        $artikelModel = new ArtikelModel();
        $tagModel = new TagModel();
        $kategoriModel = new KategoriModel();

        $tagMap = [];
        foreach ($tagModel->findAll() as $tag) {
            $tagMap[$tag['id']] = $tag;
        }

        $kategoriMap = [];
        foreach ($kategoriModel->findAll() as $kt) {
            $kategoriMap[$kt['id']] = $kt;
        }

        $data = [
            'title' => 'Artikel',
            'user' => $this->user,
            'artikelData' => $artikelModel->findAll(),
---
SELECT *
FROM `tb_artikel`