app/Controllers/Rifkkimaulana/Admin/BaseController.php

SELECT *
FROM `tb_users`
WHERE `id` = '1'
 LIMIT 1
---
	public function initController(\CodeIgniter\HTTP\RequestInterface $request, \CodeIgniter\HTTP\ResponseInterface $response, \Psr\Log\LoggerInterface $logger)
	{
		// Do Not Edit This Line
		parent::initController($request, $response, $logger);

		//--------------------------------------------------------------------
		// Preload any models, libraries, etc, here.
		//--------------------------------------------------------------------
		// E.g.:
		// $this->session = \Config\Services::session();
		$this->userModel = new UsersModel();

		$user = $this->userModel->where('id', session('user_id'))->first();