app/Controllers/Rifkkimaulana/Front/Blog.php

    public function index()
    {
        $kategoriModel = new KategoriModel();
        $tagModel = new TagModel();
        $artikelModel = new ArtikelModel();


        // Hitung jumlah artikel untuk setiap kategori
        $kategoriArticleCount = [];
        foreach ($kategoriModel->findAll() as $kategori) {
            $articleCount = $artikelModel->where("FIND_IN_SET({$kategori['id']}, kategori_id)")->countAllResults();
            $kategoriArticleCount[$kategori['id']] = $articleCount;
        }

        $tagMap = [];
        foreach ($tagModel->findAll() as $tag) {
            $tagMap[$tag['id']] = $tag;
        }

        $data = [
            'title' => 'Blog Rifkkimaulana',
            'kategoriData' => $kategoriModel->findAll(),
            'tagData' => $tagModel->findAll(),
            'artikelData' => $artikelModel->paginate(10, 'rifkkimaulana'),
            'artikelDataWidgets' => $artikelModel->limit(10)->findAll(),
---
SELECT COUNT(*) AS `numrows`
FROM `tb_artikel`
WHERE FIND_IN_SET(2, kategori_id)
SELECT *
FROM `tb_artikel`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `tb_artikel`
SELECT *
FROM `tb_artikel`

    public function detail($slug)
    {
        $kategoriModel = new KategoriModel();
        $tagModel = new TagModel();
        $artikelModel = new ArtikelModel();
        $komentarModel = new KomentarModel();

        $artikel = $artikelModel->where('slug', $slug)->first();

        // Hitung jumlah artikel untuk setiap kategori
        $kategoriArticleCount = [];
        foreach ($kategoriModel->findAll() as $kategori) {
            $articleCount = $artikelModel->where("FIND_IN_SET({$kategori['id']}, kategori_id)")->countAllResults();
            $kategoriArticleCount[$kategori['id']] = $articleCount;
        }

        $komentarCount = [];
        foreach ($komentarModel->findAll() as $komen) {
            $jumlahKomentar = $komentarModel->where('artikel_id', $komen['artikel_id'])->countAllResults();
---
SELECT *
FROM `tb_artikel`
WHERE `slug` = 'ini-adalah-artikel-pertama-yang-saya-buat-selamat-membacaa'
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `tb_artikel`
WHERE FIND_IN_SET(2, kategori_id)
SELECT *
FROM `tb_komentar`
SELECT COUNT(*) AS `numrows`
FROM `tb_komentar`
WHERE `artikel_id` = '11'


        $usersModel = new UsersModel();
        $userMap = [];
        foreach ($usersModel->findAll() as $user) {
---
SELECT *
FROM `tb_users`

            'kategoriData' => $kategoriModel->findAll(),
            'tagData' => $tagModel->findAll(),
            'artikel' => $artikel,
            'artikelDataWidgets' => $artikelModel->limit(10)->findAll(),
---
SELECT *
FROM `tb_artikel`

            'pager' => $artikelModel->pager,
            'userMap' => $userMap,
            'komentarCount' => $komentarCount,
            'komentarDataByArtikel' => $komentarModel->where('artikel_id', $artikel['id'])->findAll()
---
SELECT *
FROM `tb_komentar`
WHERE `artikel_id` = '11'
 LIMIT 1